# Задание 1
###############################################

# s = "Дана ст(рока символов, среди которых есть одна открыв)ающаяся"
# print(s[s.find("(") + 1:s.find(")")])

###############################################
# Задание 2
###############################################

# s = input("Строка: ")
# s_zam = input("Ее заменяемая подстрока: ")
# s_new = input("Новая подстрока: ")
#
# ind = s.find(s_zam)
# len_ = 0
# while ind != -1:
#     len_ = len(s_zam)
#     s = s[0:ind] + s_new + s[ind + len_:]
#     ind = s.find(s_zam)
#
# print(s)

###############################################
# Задание 3
###############################################

# s = "Ежевику для ежат \nПринесли два ежа. \nЕжевику еле-еле \nЕжата возле ели съели."
# print(s)
# print()
# s = s.title()
# ind = s.find("-")
# while ind != -1:
#     s = s[:ind] + s[ind + 2:]
#     ind = s.find("-")
# print("Количество слов:", s.count("Е"))
