# Задание 1
###############################################

# num = int(input("Введите пятизначное число: "))
# num1 = num
# a = num % 10
# num = num // 10
# b = num % 10
# num = num // 10
# c = num % 10
# num = num // 10
# d = num % 10
# e = num // 10
# pr = a * b * c * d * e
# sr = (a + b + c + d + e) / 5
# print("Произведение цифр числа ", num1, ": ", pr, sep="")
# print("Среднее арифметическое: ", sr)

###############################################

# Задание 2
###############################################

# num = int(input("Введите целое число: "))
# if num % 2 == 0:
#     print("Число", num, "- четное")
# else:
#     print("Число", num, "- нечетное")

###############################################

# Задание 3
###############################################
# print("Выберите операцию: \n1 - \"r\" - применяет унарный минус к операнду \n2 - \"+\" - сложение"
#       "\n3 - \"-\" - вычитание \n4 - \"/\" - деление \n5 - \"*\" - умножение \n6 - \"%\" - деление по модулю"
#       "\n7 - \"<\" - минимальное из двух чисел \n8 - \">\" - максимальное из двух чисел")
# num = int(input("Введите цифру: "))
# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
#
# if num == 1:
#     print("Результат:", -a, ",", -b)
# elif num == 2:
#     print("Результат:", a + b)
# elif num == 3:
#     print("Результат:", a - b)
# elif num == 4:
#     if b == 0:
#         print("На ноль делить нельзя")
#     else:
#         print("Результат:", a / b)
# elif num == 5:
#     print("Результат:", a * b)
# elif num == 6:
#     print("Результат:", a % b)
# elif num == 7:
#     if a > b:
#         print("Минимальное:", b)
#     elif a < b:
#         print("Минимальное:", a)
#     else:
#         print("Числа равны")
# elif num == 8:
#     if a > b:
#         print("Максимальное:", a)
#     elif a < b:
#         print("Максимальное:", b)
#     else:
#         print("Числа равны")

###############################################

# Задание 4
###############################################
# num = int(input("Введите число от 1 до 99: "))
#
# if num == 1 or num == 21 or num == 31 or num == 41 or num == 51 or num == 61 or num == 71 or num == 81 or num == 91:
#     print(num, "копейка")
# elif num == 2 or num == 3 or num == 4 or num == 22 or num == 23 or num == 24 or num == 32 or num == 33 or num == 34 \
#         or num == 42 or num == 43 or num == 44 or num == 52 or num == 53 or num == 54 or num == 62 or num == 63 \
#         or num == 64 or num == 72 or num == 73 or num == 74 or num == 82 or num == 83 or num == 84 \
#         or num == 92 or num == 93 or num == 94:
#     print(num, "копейки")
# else:
#     print(num, "копеек")
