import re
# Задание 1
###############################################

s = "1X, Text ABC 456 A1B2C3"
num_1 = re.findall(r"^(\d)[A-z]", s)
num_2 = re.findall(r"[A-z](\d)", s)
print(num_1 + num_2)

###############################################
# Задание 2
###############################################

s = "text from #START# till #END#"
reg = r"#START#(.+)#END#"
print(re.findall(reg, s))

###############################################
# Задание 3
###############################################

s = "12_34__56"
reg = r"(\d+)_[^_]"
print(re.findall(reg, s))