# Задание 1
###############################################

# lst_1 = [int(input("Введите элемент списка: ")) for _ in range(int(input("Введите длину списка: ")))]
# print("Список:", lst_1)
# lst_2 = []
# for i in lst_1:
#     if i >= 0:
#         lst_2.append(i)
# print("Новый список, состоящий из положительных элементов:", lst_2)
# m = lst_2[0]
# for j in lst_2:
#     if j > m:
#         m = j
# print("Наибольший элемент списка:", m)

###############################################
# Задание 2
###############################################

# lst = [int(input("-> ")) for _ in range(int(input("Введите элемент списка:\nn= ")))]
# print(lst)
# k = int(input("Введите индекс:\nk= "))
# c = int(input("Введите значение:\nc= "))
# lst.insert(k, c)
# print(lst)

###############################################
# Задание 3
###############################################

# lst = [int(input("-> ")) for _ in range(int(input("Введите элемент списка:\nn= ")))]
# print(lst)
# ch = int(input("Введите число:\nch= "))
# if ch in lst:
#     print("Число присутствует в элементах списка")
# else:
#     print("Число отсутствует")
