import re
# Задание 1
###############################################

# date = input("Введите дату в формате dd-mm-YYYY: ")
# # date = "28-08-2021"
# reg = r"^([0-2][1-9]|[1-3][0]|[3][1])-([0][1-9]|[1][0]|[1][12])-(19[0-9][0-9]|20[01][0-9]|202[0-2])$"
# print(re.findall(reg, date))


###############################################
# Задание 2
###############################################

# num1 = "MMDCCLXXIII"
# num2 = "CCCMMVIIVV"
# reg = r"^M{1,3}(?:C{1,3}|CD|D|D[C]{1,3}|CM)(?:X{1,3}|XL|L|L[X]{1,3}|XC)(?:I{1,3}|IV|V|V[I]{1,3}|IX)$"
# print(re.findall(reg, num1))
# print(re.findall(reg, num2))
