# Задание 1
###############################################

# a = int(input("Начало диапазона: "))
# b = int(input("Конец диапазона: "))
# for i in range(a, b + 1):
#     if i % 2 != 0:
#         print(i, end=" ")

###############################################
# Задание 2
###############################################

# num = 5  # Загаданное число
# count = 0
# while True:
#     a = int(input("Введите число от 1 до 100: "))
#     if 0 <= a <= 100:
#         count += 1
#         if a == 0:
#             print("Вы вышли из игры!")
#             break
#         elif a > num:
#             print("Загаданное число меньше")
#         elif a < num:
#             print("Загаданное число больше")
#         else:
#             print("Вы угадали загаданное число c", count, "раза")
#             break
#     else:
#         print("Неправильный ввод!")
#         break

###############################################
# Задание 3 (не получилось, не пойму как сделать в одну строку)
###############################################

a = 5
b = 3
for i in range(a):
    for j in range(a):
        if (i % 2 == 0 and j % 2 == 0) or (i % 2 != 0 and j % 2 != 0):
            print("+" * b, end=" ")
        else:
            print("-" * b, end=" ")
    print()





